; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_25)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 obj8 - location
	obj6 obj7 - truck
	obj9 obj10 obj11 obj12 obj13 obj14 obj16 - package
	obj15 - airplane
)

(:init
	(at obj6 obj0)
	(at obj7 obj3)
	(at obj9 obj3)
	(at obj10 obj0)
	(at obj11 obj3)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj14 obj3)
	(at obj15 obj0)
	(at obj16 obj5)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj4)
	(in-city obj8 obj1)
)

(:goal (and
	(at obj9 obj0)
	(at obj10 obj3)
	(at obj11 obj8)
	(at obj12 obj5)
	(at obj13 obj8)
	(at obj14 obj0)
	(at obj16 obj3)
))
)

; plan
1. (drive obj7 obj3 obj5)
   deleted: (at obj7 obj3)
   added: (at obj7 obj5)
   goals met: 0 of 7
2. (load obj15 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj15)
   goals met: 0 of 7
3. (load obj15 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj15)
   goals met: 0 of 7
4. (fly obj15 obj0 obj3)
   deleted: (at obj15 obj0)
   added: (at obj15 obj3)
   goals met: 0 of 7
5. (drive obj6 obj0 obj2)
   deleted: (at obj6 obj0)
   added: (at obj6 obj2)
   goals met: 0 of 7
6. (drive obj7 obj5 obj3)
   deleted: (at obj7 obj5)
   added: (at obj7 obj3)
   goals met: 0 of 7
7. (load obj15 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj15)
   goals met: 0 of 7
8. (load obj15 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj15)
   goals met: 0 of 7
9. (load obj15 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj15)
   goals met: 0 of 7
10. (unload obj15 obj12 obj3)
   deleted: (in obj12 obj15)
   added: (at obj12 obj3)
   goals met: 0 of 7
11. (fly obj15 obj3 obj0)
   deleted: (at obj15 obj3)
   added: (at obj15 obj0)
   goals met: 0 of 7
12. (load obj6 obj13 obj2)
   deleted: (at obj13 obj2)
   added: (in obj13 obj6)
   goals met: 0 of 7
13. (load obj7 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj7)
   goals met: 0 of 7
14. (unload obj15 obj11 obj0)
   deleted: (in obj11 obj15)
   added: (at obj11 obj0)
   goals met: 0 of 7
15. (drive obj6 obj2 obj0)
   deleted: (at obj6 obj2)
   added: (at obj6 obj0)
   goals met: 0 of 7
16. (drive obj7 obj3 obj5)
   deleted: (at obj7 obj3)
   added: (at obj7 obj5)
   goals met: 0 of 7
17. (load obj6 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj6)
   goals met: 0 of 7
18. (load obj7 obj16 obj5)
   deleted: (at obj16 obj5)
   added: (in obj16 obj7)
   goals met: 0 of 7
19. (unload obj15 obj14 obj0)
   deleted: (in obj14 obj15)
   added: (at obj14 obj0)
   goals met: 1 of 7
20. (unload obj15 obj9 obj0)
   deleted: (in obj9 obj15)
   added: (at obj9 obj0)
   goals met: 2 of 7
21. (unload obj7 obj12 obj5)
   deleted: (in obj12 obj7)
   added: (at obj12 obj5)
   goals met: 3 of 7
22. (drive obj6 obj0 obj8)
   deleted: (at obj6 obj0)
   added: (at obj6 obj8)
   goals met: 3 of 7
23. (drive obj7 obj5 obj3)
   deleted: (at obj7 obj5)
   added: (at obj7 obj3)
   goals met: 3 of 7
24. (fly obj15 obj0 obj3)
   deleted: (at obj15 obj0)
   added: (at obj15 obj3)
   goals met: 3 of 7
25. (unload obj15 obj10 obj3)
   deleted: (in obj10 obj15)
   added: (at obj10 obj3)
   goals met: 4 of 7
26. (unload obj6 obj11 obj8)
   deleted: (in obj11 obj6)
   added: (at obj11 obj8)
   goals met: 5 of 7
27. (unload obj6 obj13 obj8)
   deleted: (in obj13 obj6)
   added: (at obj13 obj8)
   goals met: 6 of 7
28. (unload obj7 obj16 obj3)
   deleted: (in obj16 obj7)
   added: (at obj16 obj3)
   goals met: 7 of 7
